# RelativeToView Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..RelativeToView Property
SunAndShadowSettings Class See Also
---
Identifies whether the SunAndShadowSettings element is relative to the view direction. This is only relevant for lighting mode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool RelativeToView { get; set; }
```

Visual Basic
---
```text
Public Property RelativeToView As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool RelativeToView {
	bool get ();
	void set (bool value);
}
```

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace